// 正则配置
export const regExp={
  //传真校验
  faxReg:/^(\d{3,4}-)?\d{7,8}$/,
  //邮箱校验
  emailReg:/^[a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/,
  //邮编校验
  postalReg:/^\d{6}$/,
  //qq
  qqReg:/^[1-9][0-9]{4,10}$/,
  //手机号校验
  phoneReg:/^((\+86)|(86))?(13|15|17|18)\d{9}$/,
  //银行卡号校验
  bankCardReg:/^([1-9]{1})(\d{14}|\d{18})$/,
  //固定电话校验
  telephoneReg:/^((0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/,
  //密码校验，6-16位密码，至少使用字母、数字、符号中的2种组合
  // eslint-disable-next-line no-empty-character-class
  passwordReg:/^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?!([^(0-9a-zA-Z)]|[])+$)([^(0-9a-zA-Z)]|[]|[a-z]|[A-Z]|[0-9]){6,}$/,
  //数字或小数正则
  numberOrFloat:/^[0-9]+([.]{1}[0-9]+){0,1}$/,
  //统一社会码
  SocialCodeReg:/^[0-9a-zA-Z]{18}$/,
  //整数的校验
  numberReg:/^[0-9]*$/
}
